frontend/controllers/DataController.php

	public function actionUser(){
    $this->layout="header";
    $session=Yii::$app->session;
    $session->open();
    $session['u_id']=1;
    //判断是否登陆，未登录跳转到登陆页面
    if($session['u_id'] ==''){
        $this->redirect(array('/login/login'));
    }
    //获取登录id
    $id=$session['u_id'];
    //根据查用户信息
    $data=(new \yii\db\Query())
        ->from('message')
        ->where(['u_id' => $id])
        ->one();
    //根据id查兑换商品
    $goods=(new \yii\db\Query())
        ->from('goods_log')
        ->join('LEFT JOIN','goods','goods.g_id=goods_log.g_id')
        ->where(['goods_log.u_id' => $id])
        ->all();
---
SELECT * FROM `message` WHERE `u_id`=1
SELECT * FROM `goods_log` LEFT JOIN `goods` ON goods.g_id=goods_log.g_id WHERE `goods_log`.`u_id`=1