iyou/frontend/controllers/UserController.php

SELECT COUNT(*) FROM `collect` LEFT JOIN `travel` ON travel.t_id=collect.t_id WHERE collect.u_id=1
SELECT `travel`.`t_name`, `travel`.`t_p_img`, `travel`.`t_content` FROM `collect` LEFT JOIN `travel` ON travel.t_id=collect.t_id WHERE collect.u_id=1 LIMIT 1
---
    public function actionCollection(){
        $session=Yii::$app->session;
        $session->open();
        $id=$session['u_id'];
        //根据session_id获取我收藏的景点
        $query = (new \yii\db\Query())->select(['travel.t_name','travel.t_p_img','travel.t_content'])->from('collect')->where('collect.u_id='.$id)->join('LEFT JOIN','travel','travel.t_id=collect.t_id');
        $pages = new Pagination(['totalCount' => $query->count(),'defaultPageSize'=>1]);
        $models = $query->offset($pages->offset)
            ->limit($pages->limit)
            ->all();

SELECT `present`.`p_id`, `present`.`p_name`, `present`.`p_name`, `present`.`p_jf`, `picture`.`p_img` FROM `present` LEFT JOIN `picture` ON picture.p_id=present.p_img_p WHERE p_num > 0 LIMIT 6
---
    public function actionMall(){
        $data=(new \yii\db\Query())
            ->select(['present.p_id','present.p_name','present.p_name','present.p_jf','picture.p_img'])
            ->from('present')
            ->join('LEFT JOIN','picture','picture.p_id=present.p_img_p')
            ->where("p_num > 0")
            ->limit(6)
            ->all();