frontend/models/City.php

    public function detcity($id)
    {
        //查询这个城市
        return $cityinfo = $this->find()->where(['c_id'=>$id])->asArray()->one();
---
SELECT * FROM `city` WHERE `c_id`='1'