frontend/models/Gropshop.php

SELECT * FROM `gropshop` WHERE `c_id`='1' ORDER BY `g_num` DESC
---
    public function hotels($id)
    {
        $alls = $this->find()->where(['c_id'=>$id])->orderBy(['g_num'=>SORT_DESC])->asArray()->all();